CrosswordWidth = 25;
CrosswordHeight = 19;
Words = 15;
WordLength = new Array(5, 11, 6, 4, 8, 6, 11, 10, 16, 6, 4, 5, 13, 8, 5);
Word = new Array("БЭКОН", "ИММАНЕНТНЫЙ", "ТЕАТРА", "ЛОКК", "РАЗУМНОЕ", "ПЕЩЕРЫ", "РЕЛИГИОЗНОЕ", "ЭМПИРИЧНОЕ", "ЭМПИРИОКРИТИЦИЗМ", "ЛОЖНОЕ", "РОДА", "РЫНКА", "ТЕОРЕТИЧЕСКОЕ", "ЭМПИРИЗМ", "ГОББС");
Clue = new Array("С каким именем чаще всего связывают начало философии нового времени?",
    "Цель какого эмпиризма: доказательство комбинаторности ощущений?",
    "Какие призраки по Бэкону порождены склонностью человека верить в авторитет?",
    "Кто понимает опыт, как воздействие предметов окружающего мира на наши чувства, «нет ничего в разуме, чтобы до этого не прошло через чувства»?",
    "Какое мышление связано с философией и наукой?",
    "Какие призраки по Бэкону складываются в результате индивидуальности человека, формируемой всем его социальным опытом?",
    "Какое мышление возникает в сфере геологии?",
    "Какое знание отображает действительность со стороны её внешних связей и отношений?",
    "Какое особое направление сформировалось из слияния эмпиризма и критицизма?",
    "Какое восприятие базируется на внутренних ощущениях человека по Гоббсу?",
    "Какие призраки по Бэкону обусловлены ограниченными возможностями человеческого организма, относительным несовершенством органов чувств, природой человека?",
    "Какие призраки по Бэкону возникают в результате ошибок в употреблении языка, неправильного определения понятий, многозначности некоторых из них?",
    "Какое знание систематизирует накопленный материал, придерживаясь принципа внутренних взаимосвязей, и закономерностей в движении?",
    "Направление в философии, в основе которого лежит опыт, называется?",
    "Ученик Бэкона, который придерживался теории, согласно которой человек рождается с очищенным сознанием?");
AnswerHash = new Array(14223, 34942, 6261, 41174, 42358, 27922, 19843, 42759, 36445, 97860, 2335, 50616, 32516, 37403, 81286);
WordX = new Array(13, 14, 5, 13, 2, 7, 7, 0, 14, 22, 7, 3, 8, 1, 16);
WordY = new Array(0, 3, 6, 6, 8, 10, 14, 17, 0, 0, 3, 4, 6, 10, 13);
LastHorizontalWord = 7;
OnlyCheckOnce = false;